results/wrk-nodejs-hw-c-100-d20s.txt
Running 20s test @ http://nodejs/hello-world
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    21.66ms    5.75ms  73.27ms   74.41%
    Req/Sec     1.16k   250.41     1.72k    61.50%
  Latency Distribution
     50%   20.18ms
     75%   24.42ms
     90%   29.52ms
     99%   40.42ms
  92461 requests in 20.03s, 20.99MB read
Requests/sec:   4616.37
Transfer/sec:      1.05MB