results/wrk-pure-php-hw-c-100-d20s.txt
Running 20s test @ http://pure-php/hello-world
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    65.34ms   73.86ms 560.91ms   84.00%
    Req/Sec   362.17    397.77     1.60k    68.78%
  Latency Distribution
     50%   27.73ms
     75%   84.08ms
     90%  180.76ms
     99%  324.19ms
  19395 requests in 20.23s, 3.11MB read
  Socket errors: connect 0, read 19395, write 0, timeout 0
Requests/sec:    958.84
Transfer/sec:    157.31KB